(ns chufang.data
    )

(def data
    [
     ["党参"
      "dangcan"
      "党参味甘，性平，归脾、肺经，具有补中益气、健脾益肺的功效。生党参长于益气生津。多用于肺气亏虚，气血两伤。"
      "为类圆形或椭圆形厚片或小段。切面黄白色或淡黄棕色，有裂隙和菊花纹，中央有淡黄色圆心，周边淡黄白色或黄棕色，有纵皱纹。有特殊香气，味微甜。"]
     ["米炒党参"
      "michaodangcan"
      "米党参气变清香，增强和胃、健脾止泻作用。多用于脾胃虚弱，食少便溏。"
      "形如党参，表面深黄色，具香气。"]
     ["鳖甲"
      "biejia"
      "鳖甲味咸，性微寒，归肝、肾经，具有滋阴潜阳、软坚散结、退热除蒸的功效。生鳖甲质地坚硬，有腥臭气，养阴清热、潜阳熄风之力较强。多用于热病伤阴或内伤虚热，虚风内动。"
      "为不规则的碎片，大小不一。外表面黑褐色或墨绿色，略有光泽，内表面类白色。质坚硬。气腥，味淡。"]
     ["醋鳖甲"
      "cubiejia"
      "醋鳖甲质地酥脆，易于粉碎和煎出有效成分，并能矫臭矫味。醋制还能增强入肝消积、软坚散结的作用。常用于_瘕积聚，月经停闭。"
      "形如鳖甲，表面深黄色，质酥脆，略具醋气。"]
     ["干姜"
      "ganjiang"
      "干姜味辛，性热。归脾、胃、肾、心、肺经。具有温中散寒，回阳通脉，燥湿消痰温经止血的功效。干姜辛热，以温中散寒，回阳救逆通脉为主。常用于脾胃寒证、亡阳证、寒饮喘咳。"
      "为不规则纵切片或斜切片。外皮灰黄色或浅黄棕色，切面灰黄色或灰白色。质坚实。气香、特异，味辛辣。"]
     ["炮姜"
      "paojiang"
      "炮姜味苦、辛，性温。其辛散温热之性不及干姜弱，但作用缓和持久，且长于温中止痛，能守能走，止血止泻。可用于产后腹痛。"
      "为不规则膨胀的块状。表面棕黑色或棕褐色。质轻泡，断面边缘处显棕黑色，中心棕黄色。气香，味微辛、辣。"]
     ["白芍"
      "baishao"
      "白芍味苦、酸，性微寒，归肝、脾经，具有平肝止痛、养血调经、敛阴止汗的功效。用于头痛眩晕，胁痛，腹痛，四肢挛痛，血虚萎黄，月经不调，自汗，盗汗。"
      "为近圆形或椭圆形的薄片。表面类白色或微带棕红色。片面平滑，角质样，中间类白色，有明显的环纹和放射状纹理。周边淡棕红色或粉白色，有皱纹。质坚脆。气微，味微苦酸。"]
     ["土炒白芍" "tuchaobaishao" "长于健脾柔肝止痛" "形如白芍，颜色微黄，略带焦斑，有香气。"]
     ["苍术"
      "cangshu"
      "苍术味辛、苦，性温。归脾、胃、肝经。具有燥湿健脾、祛风散寒、明目的功效。生苍术辛温而燥烈，以祛湿发汗为主。用于风湿痹痛、风寒夹湿表证、湿温发热等。"
      "为不规则的厚片。周边灰棕色，片面黄白色或灰白色，散有多数橙黄色或棕红色的油点（俗称“朱砂点”），以及析出白毛状结晶（习称“起霜”）。质坚实。气香特异，味微甘、辛、苦。"]
     ["麸炒苍术"
      "fuchaocangshu"
      "麸炒苍术辛散力减弱，燥性有所缓和，气变芳香，健脾燥湿的作用增强，用于湿困脾胃、痰饮停滞、雀目等。"
      "形如苍术片。表面淡黄色。香气较生品浓。"]
     ["枳壳"
      "zhike"
      "枳壳味苦、辛、酸，性温，归脾、胃经，具有理气宽中、行滞消胀的功效。生枳壳辛燥，作用较强，可行气宽中除胀，主要用于胁肋胀痛，瘀滞疼痛，子宫脱垂等。"
      "为不规则弧状条形薄片。表面黄白色，周边绿褐色或棕褐色。粗糙，质脆。气清香，味苦微酸。"]
     ["麸炒枳壳"
      "fuchaozhike"
      "麸炒枳壳降低刺激性，燥性和酸性较生品缓和，健胃消胀的作用有所增强。故适宜于年老体弱而气滞者。"
      "形如枳壳片。表面深黄色，略有焦斑。质脆。气香，味较弱。"]
     ["山药"
      "shanyao"
      "山药味甘，性平，归脾、胃、肾经，具有补脾益胃、生津益肺、补肾涩精的功效。山药生用以补肾生精、益肺阴为主。用于肾虚遗精，尿频，肺虚喘咳，阴虚消渴。"
      "为类圆形厚片。表面类白色或黄白色，质坚脆，粉性。气微，味淡、微酸，嚼之发黏。"]
     ["土炒山药"
      "tuchaoshanyao"
      "土炒山药增强补脾止泻作用，多用于脾虚久泻，纳呆食少。"
      "形如山药片，表面土黄色，粘有土粉，略具焦香气。"]
     ["王不留行"
      "wangbuliuxing"
      "王不留行味苦，性平，归肝、胃经，生品长于消痈肿，用于乳痈或其他疮痈肿痛。"
      "王不留行为小圆球形，表面乌黑色或红黑色，微有光泽。质坚硬，味淡。"]
     ["炒王不留行"
      "chaowangbuliuxing"
      "炒王不留行质地松泡，利于有效成分煎出，走散力较强，长于活血通经，下乳，通淋。"
      "炒王不留行大部分呈类球形白花，质脆，气香。"]
     ["白扁豆"
      "baibiandou"
      "白扁豆味甘，性微温，归脾、胃经，具有健脾化湿、和中消暑的功效。用于脾胃虚弱，食欲不振，大便溏泻，白带过多，暑湿吐泻，胸闷腹胀。扁豆生用清暑、化湿力强。"
      "为扁椭圆形或扁卵圆形，表面淡黄白色或淡黄色，平滑而略有光泽。质坚硬。种皮薄而脆，种仁黄白色。气微，味淡，嚼之有豆腥气。"]
     ["炒白扁豆" "chaobaibiandou" "炒白扁豆性微温，偏于健脾止泻。" "形如白扁豆，表面微黄色，略具焦斑，有香气。"]
     ["薏苡仁"
      "yiyiren"
      "薏苡仁味甘、淡，性凉。归脾、胃、肺经。具有利水渗湿，健脾止泻，除痹，排脓，解毒散结的功能。用于水肿，脚气，小便不利，脾虚泄泻，湿痹拘挛，肺痈，肠痈，赘疣，癌肿。生品偏寒凉，长于利水渗湿，清热排脓，除痹止痛。可用于小便不利，水肿，脚气，肺痈，肠痈，风湿痹痛，筋脉挛急及湿温病在气分。"
      "本品呈宽卵形或长椭圆形。表面乳白色，光滑，偶有残存的黄褐色种皮；一端钝圆，另端较宽而微凹，有1淡棕色点状种脐；背面圆凸，腹面有1条较宽而深的纵沟。质坚实，断面白色，粉性。气微，味微甜。"]
     ["炒薏苡仁"
      "chaoyiyiren"
      "炒薏苡仁寒凉之性偏于平和，长于健脾止泻，可用于脾虚泄泻，纳少腹胀。"
      "本品形如薏苡仁，微鼓起，表面微黄色，略有香气。"]
     ["白果"
      "baiguo"
      "白果味甘、苦、涩，性平；有毒。归肺经。具有敛肺定喘，止带缩尿的功能。用于痰多咳喘、带下白浊，遗尿尿频。生白果有毒，内服用量宜小。常用于疥癣，酒_，阴虱。"
      "本品为扁椭圆形，一端淡棕色，另一端金黄色，断面外层黄色，角质样，内层淡黄色或淡绿色，粉性，中间有空隙，无臭，味甘，微苦。"]
     ["炒白果" "chaobaiguo" "炒白果毒性降低，常用于气逆咳喘，带下。" "本品表面黄色，有火色斑点，气香。"]
     ["瓜蒌子"
      "gualouzi"
      "瓜蒌子味甘，性寒。归肺、胃、大肠经。具有润肺化痰、润肠通便的功能。瓜蒌子寒滑之性明显，长于润肺化痰，滑肠通便。用于肺热咳嗽，肠燥便秘。"
      "本品呈扁平椭圆形，表面灰棕色，沿边缘有一圈沟纹。一端较尖，有种脐，另一端钝圆或较狭。种皮坚硬，内种皮膜质，灰绿色，种仁黄白色。富油性。气微，味淡。"]
     ["炒瓜蒌子"
      "chaogualouzi"
      "炒瓜蒌子寒性减弱，长于理肺化痰。用于痰饮结阻于肺，气失宣降，咳嗽，胸闷。"
      "本品微鼓起，表面呈微黄色，具香气。"]
     ["槟榔"
      "binlang"
      "槟榔味苦、辛，性温，归胃、大肠经，具有杀虫、消积、降气、行水、截疟的功效。生品力峻，常用于治绦虫，姜片虫，蛔虫及水肿，脚气，疟疾。"
      "为类圆形薄片，表面呈棕、白色相间的大理石样花纹。质坚脆，易碎。气微，味涩、微苦。"]
     ["焦槟榔"
      "jiaobinlang"
      "焦槟榔缓和药性，以免克伐太过而耗伤正气；能减少服后恶心、腹泻、腹痛的副作用。长于消食导滞，身体素质稍强者用炒槟榔，身体素质较差者用焦槟榔。"
      "形如槟榔片，表面焦褐色，可见大理石样花纹。质脆，易碎。气微，味涩、微苦。"]
     ["栀子"
      "zhizi"
      "栀子味苦，性寒，归心、肺、三焦经，具有泻火除烦、清热利尿、凉血解毒的功效。生栀子苦寒之性甚强，易伤中气，且对胃有刺激性，脾胃较弱者服后易吐。常用于温病高热，湿热黄疸，疮疡肿毒。"
      "为不规则碎块状，表面红黄色或棕红色。果皮薄而脆，略有光泽。种子扁卵圆形，红黄色。味微酸而苦。"]
     ["焦栀子"
      "jiaozhizi"
      "焦栀子缓和寒性。一般热甚者用炒栀子，脾胃较虚弱者用焦栀子。"
      "形状同栀子或为不规则的碎块，表面焦褐色或焦黑色。果皮薄而脆，内表面棕色，种子团棕色或棕褐色。气微，味微酸而苦。"]
     ["阿胶"
      "ejiao"
      "阿胶味甘，性平，归肺、肝、肾经，具有补血滋阴、润燥、止血的功效。阿胶长于滋阴补血。用于血虚萎黄，眩晕心悸，肌痿无力，心烦失眠，虚风内动，肺燥咳嗽。"
      "为不规则的碎块或立方块，黑褐色，有光泽。断面光亮，碎片对光照视呈棕色半透明状。质硬而脆。气微，味微甘。"]
     ["蛤粉炒阿胶"
      "gefenchaoejiao"
      "蛤粉炒阿胶降低了滋腻之性，并可矫味。善于益肺润燥。用于阴虚咳嗽，久咳少痰或痰中带血。"
      "为类圆球形，表面黄白色，内部中空略呈海绵状，淡黄色，质松泡易碎，气微，味微甘。"]
     ["水红花子"
      "shuihonghuazi"
      "水红花子味咸，性微寒。归肝、胃经。具有散瘀消_、消积止痛、利水消肿的功能。生品力较猛，长于消瘀破_、化痰散结。用于_瘕痞块、瘿瘤。"
      "本品呈扁圆球形，两面微凹，顶端有短突尖，基部有果梗痕。表面棕黑色或红棕色，有光泽。质硬。味淡。"]
     ["炒水红花子"
      "chaoshuihonghuazi"
      "炒水红花子药性缓和，消食止痛和健脾利湿作用较好。用于食积腹痛，慢性肝炎、肝硬化腹水。"
      "本品质疏松，大部分爆裂成白花，具香气。"]
     ["灯芯草"
      "dengxincao"
      "灯心草味甘、淡，性微寒。归心、肺、小肠经。具有清心火、利小便的功能。灯心草长于利水通淋。用于心烦失眠，尿少涩痛，口舌生疮。"
      "本品为细圆形条状，长40_60mm，表面白色或黄白色，有细纵纹。体轻质软，略有弹性，无臭，味淡。"]
     ["青黛拌灯芯草" "qingdaibandengxincao" "清热作用增强，主要用于凉肝" "形如灯芯草，表面均匀沾满青黛粉末"]
     ["黄芪"
      "huangqi"
      "黄芪味甘，性温，归肺、脾经，生黄芪具有固表止汗、利尿托毒生肌、敛疮收口的功效。常用表虚自汗或体虚易感冒，气虚水肿，痈疽不溃或溃久不敛。"
      "为类圆形或椭圆形厚片。外表皮淡棕黄色或淡棕褐色。切面皮部黄白色，木部淡黄色，有放射状纹理及裂隙。气微，味微甜，嚼之微有豆腥味。"]
     ["蜜炙黄芪"
      "mizhihuangqi"
      "蜜黄芪药性偏润，长于益气补中。多用于脾肺气虚，食少便溏，气短乏力或兼中气下陷之久泻脱肛、子宫下垂以及气虚不能摄血的便血、崩漏等出血证；也可用于气虚便秘。"
      "形如黄芪片。外表皮浅棕黄或棕褐色，略有光泽。切面皮部浅黄色，木质部黄色，有放射状纹理及裂隙。具蜜香气，味甜，略带黏性。"]
     ["白术"
      "baishu"
      "白术味苦、甘，性温，归脾、胃经，具有健脾益气、燥湿利水、止汗、安胎的功效。生白术以健脾燥湿、利水消肿为主。多用于痰饮，水肿，风湿痹痛。"
      "为不规则厚片。表面黄白色或淡黄棕色，粗糙不平，中间色较深，有放射状纹理和棕黄色的点状油室散在，周边灰棕色或灰黄色，有皱纹和瘤状突起。质坚硬。气清香，味甘、微辛，嚼之略带黏性。"]
     ["土白术"
      "tubaishu"
      "土白术借土气资助脾土，增强补脾止泻作用。用于脾虚食少，泄泻便溏，胎动不安。"
      "形如白术，表面杏黄土色，附有细土末，有土香气。"]
     ["贯众"
      "guanzhong"
      "贯众味苦，性寒，有小毒。归肝、脾经。具有清热解毒、止血、祛虫的功效。生贯众长于驱虫，清热解毒。多用于肠道寄生虫，温热时疫，痄腮肿痛，热毒疮疡。"
      "为不规则的厚片或小块，外表面黄棕色或黑棕色。质硬而脆，气特异，味初淡而微涩，后渐苦、辛。"]
     ["贯众炭"
      "guanzhongtan"
      "贯众炭寒性减弱，长于止血。可用于衄血、便血、吐血、血痢、崩漏下血等多种出血症。"
      "为不规则的厚片或碎片。表面焦黑色，内部焦褐色。味涩。"]
     ["龟甲"
      "guijia"
      "龟甲味咸、甘，性微寒，归肝、肾、心经，具有滋阴潜阳、益肾强骨、养血补心的功效。生龟甲质地坚硬，有腥气，滋阴潜阳之力较强。多用于肝风内动，肝阳上亢等证。"
      "为不规则的碎片状。表面淡黄色或黄白色，有放射状纹理。内面黄白色，边缘呈锯齿状。质坚硬，可自骨板缝处断裂。气微腥，味微咸。"]
     ["醋龟甲"
      "cuguijia"
      "醋龟甲质地酥脆，易于粉碎，利于煎出有效成分，并能矫臭矫味。醋龟甲以补肾健骨、滋阴止血力胜，多用于劳热咯血，脚膝萎弱，潮热盗汗，痔疮肿痛。"
      "形如龟甲，表面深黄色，质松脆，略有醋气。"]
     ["大黄"
      "dahuang"
      "大黄味苦，性寒，归脾、胃、大肠、肝、心包经，具有泻热通肠、凉血解毒、逐瘀通经的功效。用于湿热便秘，积滞腹痛，泻痢不爽，湿热黄疸，血热吐衄，目赤，咽肿，肠痈腹痛，痈肿疔疮，瘀血经闭，跌扑损伤；外治水火烫伤，上消化道出血。生大黄沉降，气味重浊，走而不守，直达下焦，泻下作用峻烈，易伤胃气。以攻积导滞，泻火解毒力强。"
      "为不规则厚片或块。表面黄棕色或黄褐色。中心有纹理，微显朱砂点，习称“锦纹”。质轻。气清香，味苦而微涩。"]
     ["酒大黄"
      "jiudahuang"
      "酒大黄借酒升提之性，引药上行，以清上焦血分热毒为主，用于目赤咽肿，牙龈肿痛。"
      "形如大黄。表面深棕色或棕褐色，偶有焦斑。断面呈浅棕色。质坚实。略有酒香气。"]
     ["延胡索"
      "yanhusuo"
      "延胡索味辛、苦，性温,归心、肝、脾经,具有活血、行气、止痛的功效。生延胡索以活血化瘀力胜。多用于心血瘀滞，胸痹心痛。"
      "呈圆形薄片或不规则的碎颗粒。表面黄色或黄褐色，有不规则网状皱纹；断面黄色，角质样，具蜡样光泽。质硬而脆。气微，味苦。"]
     ["醋延胡索"
      "cuyanhusuo"
      "醋延胡索入肝经更专，止痛成分易于溶出，利气止痛作用增强。"
      "形如延胡索，表面深黄色或焦黄色，味苦，略有醋气。"]
     ["藕节"
      "oujie"
      "藕节味甘、涩，性平。归肝、肺、胃经。功效止血、消瘀。生藕节性偏凉，止血兼能凉血、化瘀，常用于吐血、咯血等多种出血症，尢适于卒暴出血。"
      "为短圆柱形，中部稍膨大。表面灰黄棕色至暗棕色，断面灰黄色至灰淡棕色。质硬。气微，味微甘涩。"]
     ["藕节炭"
      "oujietan"
      "藕节炭性平偏温，收涩作用强，多用于虚寒的慢性出血反复不止。"
      "形如藕节。表面呈焦黑色，内部黄褐色。质坚脆。具焦香气，味苦。"]
     ["鱼鳔"
      "yubiao"
      "鱼鳔味甘、咸，性平。归肾经。具有补肾益精，滋养筋脉，止血，散瘀的功能。"
      "本品呈小方块状或不规则条状，黄白色或淡黄色，半透明角质样，质坚韧，气微腥，味淡。"]
     ["烫鱼鳔"
      "tangyubiao"
      "滑石粉炒鱼鳔滋腻之性降低，腥臭味得以矫正；炒制还能使其质地酥脆，利于粉碎。临床多用其制品，用于肾虚滑精，吐血，血崩。"
      "本品呈黄色，表面鼓胀发泡，质地酥脆，气微香。"]
     ["莱菔子"
      "laifuzi"
      "味甘、辛，性平，归肺、脾、胃经，生品能升能散，长于涌吐风痰。用于食积气滞，嗳气吞酸，痰壅咳嗽。"
      "呈卵圆形或椭圆形，稍扁。表面黄棕色、红棕色或灰褐色。断面黄色，味微苦辛。"]
     ["炒莱菔子"
      "chaolaifuzi"
      "改变药性，转升为降；鼓起爆裂，质变酥脆，利于粉碎和煎出有效成分。长于消食除胀、降气化痰。"
      "形如莱菔子，鼓起，表面颜色加深，断面深黄色，质脆，有香气。"]
     ["甘草"
      "gancao"
      "甘草味甘，性平，归心、肺、胃经，具有补脾益气、清热解毒、祛痰止咳、缓急止痛、调和诸药的功效。生甘草味甘性平偏凉，长于泻火解毒、化痰止咳。多用于痰热咳嗽，咽喉肿痛，痈疽疮毒，食物中毒及中药中毒。"
      "为类圆形或椭圆形切片。表面棕红色、棕色或灰棕色，粗糙，具纵皱纹。切面黄白色，形成层明显,射线放射状，传统称为“菊花心”，纤维明显，具粉性。气微，味甜而特异。"]
     ["蜜炙甘草"
      "mizhigancao"
      "蜜甘草性温，补脾和胃、益气复脉力胜。常用于脾胃虚弱，倦怠乏力，心动悸，脉结代。"
      "形如甘草片，表面红棕色或灰棕色，微有光泽，切面黄色至深黄色，形成层明显，射线放射状，质稍黏，具焦香气，味甜。"]
     ["大豆" "dadou" "一般不直接药用，采用发芽法制成大豆黄卷后药用。" "略"]
     ["大豆黄卷"
      "dadouhuangjuan"
      "大豆黄卷味甘，性平。归脾、胃经。具有清利湿热、清解表邪的功能。用于夏月感冒、暑湿、湿温。"
      "呈肾形， 表面灰黄色、黑褐色或紫褐色，光亮，有横向皱纹，一侧有长圆形种脐，种皮常裂开、破碎或脱落。胚根细长，伸出种皮之外，弯曲，质脆易断。气无，味淡，有油腻感。以粒大饱满、有皱纹及短芽者为佳。"]
     ["苦杏仁"
      "kuxingren"
      "苦杏仁味苦，性微温，有小毒，归肺、大肠经，具有降气止咳平喘、润肠通便的功能。用于咳嗽气喘，胸满痰多，血虚津枯，肠燥便秘。"
      "为心脏形，略扁。表面黄棕色或深棕色，有微细纵皱，顶端略尖，底部钝圆肥厚，左右不对称，富油性。气微，味苦。"]
     ["_苦杏仁"
      "_kuxingren"
      "_苦杏仁杀酶保苷，降低毒性，并可除去非药用部位，便于有效成分煎出。_制品作用与生苦杏仁相同。"
      "无种皮或分离为单瓣，表面乳白色，有特殊的香气，味苦。"]
     ["白矾"
      "baifan"
      "白矾味酸、涩，性寒，归肺、大肠、肝经，外用解毒杀虫、燥湿止痒。用于湿疹，疥癣，聍耳流脓，常制成散剂、洗剂、含嗽剂使用。内服止血止泻，祛除风痰。用于久泻不止，便血，崩漏，癫痫发狂。"
      "为不规则的块状或粉末。无色或淡黄白色，透明或半透明。表面略平滑或凹凸不平，具细密纵棱，有玻璃样光泽。质硬而脆。气微，味酸、微甘而极涩。"]
     ["枯矾"
      "kufan"
      "枯矾酸寒之性降低，涌吐作用减弱，增强收湿敛疮、止血化腐作用。用于湿疹湿疮，聍耳流脓，阴痒带下，鼻衄齿衄，鼻息肉。"
      "为粉末状。白色，不透明，蜂窝状。体轻质松。味酸涩。"]
     ["白茅根"
      "baimaogen"
      "白茅根味甘，性寒。归肺、胃、膀胱经。具有凉血止血、清热利尿的功能。生白茅根长于凉血、清热利尿。常用于血热妄行的多种出血证，热淋，小便不利，水肿，湿热黄疸，热盛烦渴，胃热呕哕及肺热咳嗽。"
      "本品为圆柱状短段。表面黄白色或淡黄色，微有光泽，具纵皱纹，有时可见稍隆起的节，呈浅黄棕色。切面皮部白色，多有裂隙，放射状排列，中柱淡黄色或中空，易与皮部剥离。体轻，质略脆。气微，味微甜。"]
     ["白茅根炭"
      "baimaogentan"
      "茅根炭味涩，寒性减弱。清热凉血作用轻微，止血作用增强，专用于出血证，并偏于收敛止血，常用于出血证较急者。"
      "本品形如白茅根，表面黑褐色至黑色，具纵皱纹，有的可见淡棕色稍隆起的节。略具焦香气，味苦。"]
     ["百合"
      "baihe"
      "百合味甘，性寒，归心、肺经，生品擅长清心安神，适用于热病后余热未清，虚烦惊悸，精神恍惚，心烦等症。"
      "为长椭圆形，中部厚，边缘薄，略向内弯曲。表面类白色、淡棕黄色或微带紫色。顶端稍尖，基部较宽。质硬而脆，断面较平坦，角质样。气微，味微苦。"]
     ["蜜炙百合"
      "mizhibaihe"
      "蜜百合润肺止咳作用增强，多用于肺虚久咳或肺痨咳血。"
      "形如百合，多呈黄色，光泽明显，略带黏性，味甜微苦。"]
     ["山楂"
      "shanzha"
      "山楂味酸、甘，性微温，归脾、胃、肝经，具有消食健胃、行气散瘀的功效。长于活血化瘀，多用于血瘀经闭，产后瘀阻，心腹刺痛及高脂血症、高血压病、冠心病。"
      "为圆片状，皱缩不平。外皮红色。果肉深黄色至浅棕色，中间有浅黄色果核。气微清香，味酸、微甜。"]
     ["焦山楂"
      "jiaoshanzha"
      "焦山楂酸味减弱，增加苦味，长于消食止泻。"
      "形如山楂，表面焦褐色，断面焦黄色。气清香，味酸、微涩。"]
     ["黑豆"
      "heidou"
      "味甘、性平、无毒。有解表清热、养血平肝、补肾壮阴、补虚黑发之功效。"
      "该品椭圆形或类球形，稍扁，长6—12mm，直径5—9mm。表面黑色或灰黑色，光滑或有皱纹，具光泽，一侧有淡黄白色长椭圆形种脐。质坚硬。种皮薄而脆，子叶2，肥厚，黄绿色或淡黄色。气微，味淡，嚼之有豆腥气味。"]
     ["淡豆豉"
      "dandouchi"
      "淡豆豉味苦、辛，凉。归肺、胃经。具有解表、除烦的功能。用于伤风感冒、发热恶寒、头痛，或胸中烦闷，虚烦不眠。"
      "本品呈椭圆形，略扁，表面黑色，皱缩不平。质柔软，断面棕黑色。气香，味微甘。"]
     ["郁金"
      "yujin"
      "郁金味辛、苦，性寒。归肝、心、肺经。具有活血止痛、行气解郁、清心凉血、利胆退黄的功能。多生用，善疏肝行气以解郁，活血祛痰以止痛。"
      "本品椭圆形或长条形薄片，外表灰黄色、灰褐色或灰棕色，具不规则的纵皱纹，纵纹隆起处颜色较浅。切面灰棕色、橙黄色至灰黑色，角质样；内皮层环明显，质坚实。气微，味淡。"]
     ["醋郁金" "cuyujin" "醋郁金能引药入血，增强疏肝止痛作用。" "本品形如郁金片，呈暗黄色，略有醋气。"]
     ["川芎"
      "chuanxiong"
      "川芎味辛，性温，归肝、胆、心包经，具有活血行气、祛风止痛的功效。用于月经不调，经闭痛经，症瘕腹痛，胸胁刺痛，跌扑肿痛，头痛，风湿痹痛。本品辛温走窜，能升能散，上行头目，旁达四肢，下行血海，为血中之气药。"
      "为不规则的薄片。表面黄白色或灰黄色。可见波状环纹或不规则多角形的纹理，散有黄棕色的小油点（油室），切面光滑，周边粗糙不整齐。质坚韧。具特异香气，味苦辛，稍有麻舌感，微回甜。"]
     ["酒川芎"
      "jiuchuanxiong"
      "酒川芎引药上行，增强活血行气止痛作用。"
      "形如川芎。色泽加深，偶见焦班。质坚脆。略有酒气。"]
     ["蛇蜕"
      "shetui"
      "蛇蜕味咸、甘，性平，归肝经，具有祛风、定惊、解毒、退翳的功效。用于小儿惊风，抽搐痉挛，翳障，喉痹，疔肿，皮肤瘙痒。生品有腥气。"
      "为圆筒形小段，多压扁而皱缩。背部银灰色或淡灰棕色。有光泽，具菱形或椭圆形鳞迹，鳞迹衔接处呈白色，略抽皱或凹下；腹部乳白色或略显黄色，鳞迹长方形，呈覆瓦状排列。体轻，质微韧，手捏有润滑感和弹性，轻轻搓揉，沙沙作响。气微腥，味淡或微咸。"]
     ["酒蛇蜕" "jiushetui" "酒蛇蜕可增强祛风作用，并可减少腥气，利于服用。" "形如蛇蜕。微显黄色。略有酒气。"]
     ["黄柏"
      "huangbai"
      "黄柏味苦，性寒，归肾、膀胱经，具有清热燥湿、火解毒功效。生黄柏苦燥，清热燥湿作用较强。多用于湿热泻痢，湿热黄疸，小便淋沥涩痛，赤白带下，疮疡肿毒，湿疹，烧烫伤。"
      "为微卷曲的细丝或块。表面黄褐色或黄棕色。断面纤维性，呈裂片状分层，鲜黄色。体轻、质硬。气微，味极苦，嚼之有黏性。"]
     ["盐黄柏"
      "yanhuangbai"
      "盐黄柏引药下行入肾，缓和苦燥之性，不伤脾胃，增加了滋肾阴、泻肾火、退虚热的作用。用于阴虚发热，梦遗滑精，骨蒸劳热，盗汗，咳嗽咯血。"
      "形如黄柏丝或块，表面深黄色，外表有少量焦斑，味苦微咸。"]
     ["知母"
      "zhimu"
      "知母味苦、甘，性寒，归肺、胃、肾经，具有清热泻火、生津润燥功效。其苦寒而不燥，上能清肺、中能凉胃、下能泻肾火；既能清实热，又可退虚热。生知母苦寒滑利，长于清热泻火、生津润燥，尤善清肺、胃之火。常用于外感热病、高热烦躁、口渴、脉洪大等肺胃实热之症，以及肺热燥咳、痰黄而稠。"
      "为扁圆形或条状片，表面黄棕色至棕色，断面黄白色。气微，味微甜、略苦，嚼之带黏性。"]
     ["盐知母"
      "yanzhimu"
      "盐知母引药下行，专于入肾，增强滋阴降火的作用，善清虚热。常用于肝肾阴亏，虚火上炎，骨蒸潮热，盗汗遗精，虚劳咳嗽。"
      "形如知母片，色泽加深，偶有焦斑，略具咸味。"]
     ["淫羊藿"
      "yinyanghuo"
      "淫羊藿味辛、甘，性温，归肝、肾经，具有补肾阳、强筋骨、祛风湿的功效。生淫羊藿偏于祛风湿。多用于风寒湿痹，中风偏瘫及小儿麻痹症。"
      "为丝片状。上表面黄绿色或淡黄色，光滑，可见网纹状叶脉；下表面灰绿色，被有白粉，中脉及细脉凸出，边缘有细刺状锯齿。丝片革质或近革质。无臭，味苦。"]
     ["炙淫羊藿"
      "zhiyinyanghuo"
      "炙淫羊藿增强温肾补阳，强壮筋骨的功效。多用于肾阳虚衰，阳痿，遗精，腰膝酸软，筋骨痿软之证。"
      "形如淫羊藿，表面微黄色，光亮，微有羊脂油气。"]
     ["天南星"
      "tiannanxing"
      "天南星味苦、辛，性温；有毒。归肺、肝、脾经。具有燥湿化痰，驱风止痉，散结消肿的功效，多用于顽痰咳嗽，风痰眩晕，中风痰壅，口眼歪斜，半身不遂；癫痫，惊风，破伤风。生天南星辛温燥烈，有毒，多外用。也有内服者，以祛风止痉为主，多用于破伤风。"
      "呈扁圆形，表面类白色或淡棕色，较光滑，顶端有凹陷的茎痕，周围有麻点状根痕，有的块茎周边有小扁球状侧芽。质坚硬，断面白色，粉质，气微辛，味麻辣。"]
     ["制天南星"
      "zhitiannanxing"
      "制天南星毒性降低，增强燥湿化痰的作用。"
      "黄白色或淡棕色薄片，半透明，质脆易碎，味涩微麻。"]
     ["芒硝"
      "mangxiao"
      "芒硝味咸、苦，性寒，归胃、大肠经，具有泻热通便、润燥软坚、清火消肿的功能。芒硝的粗制品称朴硝，为天然产品加热水溶解滤过后，结晶制得。朴硝虽然除去了泥沙和不溶性杂质，但仍含较多杂质，多外用。具有软坚散结作用。如外敷腹部用于食积；或外敷用于乳痈等症。"
      "芒硝的晶体为短柱状或针状，一般这些晶体聚集在一起成块状、纤维团簇状。"]
     ["制芒硝"
      "zhimangxiao"
      "芒硝除去杂质，提高了纯净度；由于萝卜性温，具有消积滞、化痰热、下气、宽中作用，可缓和芒硝的寒泻之性，增强润燥软坚、消导、下气通便的作用。芒硝具有泻热通便、润燥软坚、清火消肿的功效。用于实热便秘，大便燥结，积滞腹痛，肠痈肿痛等症。"
      "为棱柱状、长方形或不规则块状及粒状。无色透明或类白色半透明，质脆易碎，断面呈玻璃样光泽。气微，味咸。"]
     ["骨碎补"
      "gusuibu"
      "味苦，性温，归肾、肝经，具有补肾强骨、续伤止痛的功效。生骨碎补密被鳞片，不易除净，且质地坚硬而韧，不利于粉碎和煎出有效成分。"
      "为不规则的厚片。片面红棕色或淡红棕色，可见黄色点状维管束排列成环。周边密被深棕色至暗棕色的鳞片，柔软如毛，经火燎者呈棕褐色或暗褐色，体轻，质脆，易折断。气微，味淡，微涩。"]
     ["砂炒骨碎补"
      "shachaogusuibu"
      "砂炒骨碎补质地松脆，易于除去绒毛，利于粉碎和煎出有效成分，便于调剂和制剂。临床多用其炮制品。用于肾虚腰痛，耳鸣耳聋，牙齿松动，跌扑闪挫，筋骨折伤等症。"
      "鼓起，呈软木状，表面棕褐色或焦黄色，无鳞片，断面淡棕褐色或淡棕色，质松脆，味微苦涩。"]
     ["麦芽"
      "maiya"
      "味甘，性平。归脾、胃经。具有健脾和胃、疏肝通乳的功能。用于消化不良，乳汁郁积，乳癖。可与谷芽、山楂、白术、陈皮等同用，治一般消化不良，对米、面积滞或果积有化积开胃作用。"
      "呈梭形，表面淡黄色，背面为外稃包围，具5脉。一端有幼芽，淡黄色，皱缩或脱落，下端有纤细而弯曲的须根数条。质硬，断面白色，粉性。气微，味微甘。"]
     ["焦麦芽"
      "jiaomaiya"
      "味辛、苦，性温，归心、肝、脾经，具有活血行气、通经止痛、消肿生肌功效。生乳香气味辛烈，对胃有较强的刺激性，易引起恶心呕吐，活血消肿、止痛力强。多用于跌扑损伤、瘀血肿痛、疮溃不敛或外用。"
      "表面焦褐色，有焦香气。"]
     ["乳香"
      "ruxiang"
      "主入肝经血分，增强散瘀止血、理气止痛、收敛生肌的功效，并可缓和刺激性，且便于服用，易于粉碎，矫臭矫味。"
      "呈不规则乳头状小颗粒或小团块状。表面深黄色，半透明，稍有光泽，附有白色粉尘。质坚脆，有黏性。气香，味苦、辛。"]
     ["醋炙乳香"
      "cuzhiruxiang"
      "醋柴胡缓和升散之性，降低解表退热作用，并可增强疏肝止痛作用。多用于肝郁气滞的胁痛，腹痛及月经不调等症。"
      "形如乳香，表面深黄色，显油亮，略有醋气。"]
     ["肉豆蔻"
      "roudoukou"
      "味辛，性温，归脾、胃、大肠经，具有温中行气、涩肠止泻的功效。肉豆蔻古代虽有用生品消食止呕之说，但因含有大量油脂，有滑肠之弊，并具刺激性，故多用煨制品。"
      "为卵圆形或椭圆形，表面灰黄色或灰棕色，有的外被白粉（石灰粉末）。气香浓烈，味辛。"]
     ["煨肉豆蔻"
      "weiroudoukou"
      "固肠作用增强，常用于脾胃虚寒，久泻不止，脘腹胀痛，食少呕吐等症。"
      "形如肉豆蔻，表面棕色，有油迹，有裂隙。香气更浓烈，味辛。"]
     ["枳壳2"
      "zhike2"
      "枳壳味苦、辛、酸，性温，归脾、胃经，具有理气宽中、行滞消胀的功效。生枳壳辛燥，作用较强，可行气宽中除胀，主要用于胁肋胀痛，瘀滞疼痛，子宫脱垂等。"
      "为不规则弧状条形薄片。表面黄白色，周边绿褐色或棕褐色。粗糙，质脆。气清香，味苦微酸。"]
     ["麸炒枳壳2"
      "fuchaozhike2"
      "麸炒枳壳降低刺激性，燥性和酸性较生品缓和，健胃消胀的作用有所增强。故适宜于年老体弱而气滞者。"
      "形如枳壳片。表面深黄色，略有焦斑。质脆。气香，味较弱。"]
     ["甘草2"
      "gancao2"
      "甘草味甘，性平，归心、肺、胃经，具有补脾益气、清热解毒、祛痰止咳、缓急止痛、调和诸药的功效。生甘草味甘性平偏凉，长于泻火解毒、化痰止咳。多用于痰热咳嗽，咽喉肿痛，痈疽疮毒，食物中毒及中药中毒。"
      "为类圆形或椭圆形切片。表面棕红色、棕色或灰棕色，粗糙，具纵皱纹。切面黄白色，形成层明显,射线放射状，传统称为“菊花心”，纤维明显，具粉性。气微，味甜而特异。"]
     ["蜜炙甘草2"
      "mizhigancao2"
      "蜜甘草性温，补脾和胃、益气复脉力胜。常用于脾胃虚弱，倦怠乏力，心动悸，脉结代。"
      "形如甘草片，表面红棕色或灰棕色，微有光泽，切面黄色至深黄色，形成层明显，射线放射状，质稍黏，具焦香气，味甜。"]]
    )


; name 药品名, treat 功能主治,form 性状
; {
;   "麦芽"   {:name "麦芽" :treat "xx" :form "yy"}
;   "焦麦芽" {:name "焦麦芽" :treat "xx" :form "yy"}
; ...
; }
(def data-hash (into {} (
                            map (fn [[name filename treat form]]
                                    [name {:name name :filename filename :treat treat :form form}]
                                    )
                                data
                                )))

; [ ["麦芽" "焦麦芽"] ["乳香" "醋炙乳香"] ]
(def data-pair (->> (map-indexed (fn [index [name filename treat form]]
                                     (if (even? index)
                                         [name (first (data (inc index)))]
                                         nil
                                         )
                                     ) data)
                    (remove nil?)
                    )
    )

; {
;  "麦芽" "焦麦芽"
;  "焦麦芽" "麦芽"
;  "乳香" "醋炙乳香"
;  "醋炙乳香" "乳香"
; }
;
(def data-pair-hash (into (into
                              {}
                              data-pair
                              )
                          (map (fn [[name1 name2]] [name2 name1]) data-pair)))

;; export
; 检查是否配对
(defn paired? [name1 name2]
    (= (data-pair-hash name1) name2)
    )

; 得到8对16个随机药品
(defn sample-data [pair-count]
    (map #(data-hash %) (shuffle (flatten (take pair-count (shuffle data-pair)))))
    )

